Revit 2027 API
BuiltInFailures.ScheduleViewFailures.CannotPlaceInternalScheduleSegment Property
 Internal schedule segments cannot be placed with drag and drop
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotPlaceInternalScheduleSegment { get; }
Public Shared ReadOnly Property CannotPlaceInternalScheduleSegment As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotPlaceInternalScheduleSegment {
	FailureDefinitionId^ get ();
}
static member CannotPlaceInternalScheduleSegment : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ScheduleViewFailures Class
Autodesk.Revit.DB Namespace